MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP64GP206/mcu.h
#define _CM4FLTR_CFSEL1_POSITION                 0x00000005
#define _CM4FLTR_CFSEL1_MASK                     0x00000020
#define _CM4FLTR_CFSEL1_LENGTH                   0x00000001

#define _CM4FLTR_CFSEL2_POSITION                 0x00000006
#define _CM4FLTR_CFSEL2_MASK                     0x00000040
#define _CM4FLTR_CFSEL2_LENGTH                   0x00000001

#define _PTGCST_PTGITM_POSITION                  0x00000000
#define _PTGCST_PTGITM_MASK                      0x00000003
#define _PTGCST_PTGITM_LENGTH                    0x00000002

#define _PTGCST_PTGWTO_POSITION                  0x00000006
#define _PTGCST_PTGWTO_MASK                      0x00000040
#define _PTGCST_PTGWTO_LENGTH                    0x00000001

#define _PTGCST_PTGSTRT_POSITION                 0x00000007
#define _PTGCST_PTGSTRT_MASK                     0x00000080
#define _PTGCST_PTGSTRT_LENGTH                   0x00000001

#define _PTGCST_PTGIVIS_POSITION                 0x00000008
#define _PTGCST_PTGIVIS_MASK                     0x00000100
#define _PTGCST_PTGIVIS_LENGTH                   0x00000001

#define _PTGCST_PTGSSEN_POSITION                 0x00000009
#define _PTGCST_PTGSSEN_MASK                     0x00000200
#define _PTGCST_PTGSSEN_LENGTH                   0x00000001

#define _PTGCST_PTGSWT_POSITION                  0x0000000A
#define _PTGCST_PTGSWT_MASK                      0x00000400
#define _PTGCST_PTGSWT_LENGTH                    0x00000001

#define _PTGCST_PTGTOGL_POSITION                 0x0000000C
#define _PTGCST_PTGTOGL_MASK                     0x00001000
#define _PTGCST_PTGTOGL_LENGTH                   0x00000001

#define _PTGCST_PTGSIDL_POSITION                 0x0000000D
#define _PTGCST_PTGSIDL_MASK                     0x00002000
#define _PTGCST_PTGSIDL_LENGTH                   0x00000001

#define _PTGCST_PTGEN_POSITION                   0x0000000F
#define _PTGCST_PTGEN_MASK                       0x00008000
#define _PTGCST_PTGEN_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000000
#define _PTGCON_PTGWDT_MASK                      0x00000007
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

#define _PTGCON_PTGPWD_POSITION                  0x00000004
#define _PTGCON_PTGPWD_MASK                      0x000000F0
#define _PTGCON_PTGPWD_LENGTH                    0x00000004

#define _PTGCON_PTGDIV_POSITION                  0x00000008
#define _PTGCON_PTGDIV_MASK                      0x00001F00
#define _PTGCON_PTGDIV_LENGTH                    0x00000005

#define _PTGCON_PTGCLK_POSITION                  0x0000000D
#define _PTGCON_PTGCLK_MASK                      0x0000E000
#define _PTGCON_PTGCLK_LENGTH                    0x00000003

#define _PTGBTE_OC1TSS_POSITION                  0x00000000
#define _PTGBTE_OC1TSS_MASK                      0x00000001
#define _PTGBTE_OC1TSS_LENGTH                    0x00000001

#define _PTGBTE_OC2TSS_POSITION                  0x00000001
#define _PTGBTE_OC2TSS_MASK                      0x00000002
#define _PTGBTE_OC2TSS_LENGTH                    0x00000001

#define _PTGBTE_OC3TSS_POSITION                  0x00000002
#define _PTGBTE_OC3TSS_MASK                      0x00000004
#define _PTGBTE_OC3TSS_LENGTH                    0x00000001

#define _PTGBTE_OC4TSS_POSITION                  0x00000003
#define _PTGBTE_OC4TSS_MASK                      0x00000008
#define _PTGBTE_OC4TSS_LENGTH                    0x00000001

#define _PTGBTE_OC1CS_POSITION                   0x00000004
#define _PTGBTE_OC1CS_MASK                       0x00000010
#define _PTGBTE_OC1CS_LENGTH                     0x00000001

#define _PTGBTE_OC2CS_POSITION                   0x00000005
#define _PTGBTE_OC2CS_MASK                       0x00000020
#define _PTGBTE_OC2CS_LENGTH                     0x00000001

#define _PTGBTE_OC3CS_POSITION                   0x00000006
#define _PTGBTE_OC3CS_MASK                       0x00000040
#define _PTGBTE_OC3CS_LENGTH                     0x00000001

#define _PTGBTE_OC4CS_POSITION                   0x00000007
#define _PTGBTE_OC4CS_MASK                       0x00000080
#define _PTGBTE_OC4CS_LENGTH                     0x00000001

#define _PTGBTE_IC1TSS_POSITION                  0x00000008
#define _PTGBTE_IC1TSS_MASK                      0x00000100
#define _PTGBTE_IC1TSS_LENGTH                    0x00000001

#define _PTGBTE_IC2TSS_POSITION                  0x00000009
#define _PTGBTE_IC2TSS_MASK                      0x00000200
#define _PTGBTE_IC2TSS_LENGTH                    0x00000001

#define _PTGBTE_IC3TSS_POSITION                  0x0000000A
#define _PTGBTE_IC3TSS_MASK                      0x00000400
#define _PTGBTE_IC3TSS_LENGTH                    0x00000001

#define _PTGBTE_IC4TSS_POSITION                  0x0000000B
#define _PTGBTE_IC4TSS_MASK                      0x00000800
#define _PTGBTE_IC4TSS_LENGTH                    0x00000001

#define _PTGBTE_ADCTS1_POSITION                  0x0000000C
#define _PTGBTE_ADCTS1_MASK                      0x00001000
#define _PTGBTE_ADCTS1_LENGTH                    0x00000001

#define _PTGBTE_ADCTS2_POSITION                  0x0000000D
#define _PTGBTE_ADCTS2_MASK                      0x00002000
#define _PTGBTE_ADCTS2_LENGTH                    0x00000001

#define _PTGBTE_ADCTS3_POSITION                  0x0000000E
#define _PTGBTE_ADCTS3_MASK                      0x00004000
#define _PTGBTE_ADCTS3_LENGTH                    0x00000001

#define _PTGBTE_ADCTS4_POSITION                  0x0000000F
#define _PTGBTE_ADCTS4_MASK                      0x00008000
#define _PTGBTE_ADCTS4_LENGTH                    0x00000001

#define _PTGBTE_PTGBTE_POSITION                  0x00000000
#define _PTGBTE_PTGBTE_MASK                      0x0000FFFF
#define _PTGBTE_PTGBTE_LENGTH                    0x00000010

#define _PTGQPTR_PTGQPTR_POSITION                0x00000000
#define _PTGQPTR_PTGQPTR_MASK                    0x0000001F
#define _PTGQPTR_PTGQPTR_LENGTH                  0x00000005

#define _PTGQUE0_STEP0_POSITION                  0x00000000
#define _PTGQUE0_STEP0_MASK                      0x000000FF
#define _PTGQUE0_STEP0_LENGTH                    0x00000008

#define _PTGQUE0_STEP1_POSITION                  0x00000008
#define _PTGQUE0_STEP1_MASK                      0x0000FF00
#define _PTGQUE0_STEP1_LENGTH                    0x00000008

#define _PTGQUE1_STEP2_POSITION                  0x00000000
#define _PTGQUE1_STEP2_MASK                      0x000000FF
#define _PTGQUE1_STEP2_LENGTH                    0x00000008

#define _PTGQUE1_STEP3_POSITION                  0x00000008
#define _PTGQUE1_STEP3_MASK                      0x0000FF00
#define _PTGQUE1_STEP3_LENGTH                    0x00000008

#define _PTGQUE2_STEP4_POSITION                  0x00000000
#define _PTGQUE2_STEP4_MASK                      0x000000FF
#define _PTGQUE2_STEP4_LENGTH                    0x00000008

#define _PTGQUE2_STEP5_POSITION                  0x00000008
#define _PTGQUE2_STEP5_MASK                      0x0000FF00
#define _PTGQUE2_STEP5_LENGTH                    0x00000008

#define _PTGQUE3_STEP6_POSITION                  0x00000000
#define _PTGQUE3_STEP6_MASK                      0x000000FF
#define _PTGQUE3_STEP6_LENGTH                    0x00000008

#define _PTGQUE3_STEP7_POSITION                  0x00000008
#define _PTGQUE3_STEP7_MASK                      0x0000FF00
#define _PTGQUE3_STEP7_LENGTH                    0x00000008

#define _PTGQUE4_STEP8_POSITION                  0x00000000
#define _PTGQUE4_STEP8_MASK                      0x000000FF
#define _PTGQUE4_STEP8_LENGTH                    0x00000008

#define _PTGQUE4_STEP9_POSITION                  0x00000008
#define _PTGQUE4_STEP9_MASK                      0x0000FF00
#define _PTGQUE4_STEP9_LENGTH                    0x00000008

